{"template":"/home/wtkc/Projects/website/src/containers/BlogPost","sharedHashesByProp":{},"data":{"post":{"content":"I'm finally getting around to publishing some entries about my study abroad experience. Please hold your applause until the end, thank you.\n\nI was in Shanghai between August and December of 2019 in an effort to make Chinese a little less horrible. During that time I stayed East China Normal University's Zhongbei campus (ECNU/华东师范大学).\n\n# The Campus\n\nECNU has a lovely campus with lots of garden space to enjoy. There are lots of small Shanghainese restaurants in the immediate area in addition to the school having several excellent cafeterias. There are even a few shops on campus where you can grab a quick snack or supplies.\n\n#### ![ECNU](/uploads/img_20191206_155614.jpg \"ECNU\")*ECNU from my dorm floor*\n\nThe program itself was very large and pulled from universities all around the world, so I had the pleasure of being the only American in my class. Zhongbei campus is close to the heart of Shanghai, about a 30 minute metro ride from the Bund, Lujiazui, and Nanjing Road.\n\n#### ![Lujiazui from The Bund](/uploads/mvimg_20191020_213145.jpg \"Lujiazui from The Bund\")*Lujiazui from The Bund*\n\nThe neighborhood around ECNU has several shopping centers as well Changfeng Park (长风公园). Lots of places to explore and enjoy.\n\n# Classes\n\nIt's probably not that surprising that most of my class time was dedicated to language learning. Five days per week (Monday through Friday) I had classes taught in Mandarin from 8:30 - 11:45am. There was a 15 minute break halfway through which I liked to use to grab coffee from the shop across the street.\n\n## Speaking\n\nOn Monday and Wednesday I had speaking class. This mainly focused on new grammar and proper use of the words/grammar I already know. There was also new vocabulary introduced each period. Classes focused rather intensely on naming synonyms/antonyms of known vocabulary, as well as articulating the differences between closely related words and phrases. I really appreciated these lessons even for that reason alone. They were great for cultivating a better command of the language.\n\n#### ![Class building](/uploads/mvimg_20190924_092023.jpg \"Class building\")*Class building*\n\n## Reading/Writing\n\nOn Tuesday and Thursday I had reading/writing class taught in the same room but with a different professor. Much of this class consisted of talking turns from a presentation prepared by the professor. We also had to take weekly dictation tests during which we had to write the new vocabulary as the professor read it aloud. As you might imagine, this isn't as straightforward in Chinese as it is in other languages.\n\n## Listening\n\nFriday mornings were for listening class. Listening to audio tracks and taking short workbook quizzes about them was the main focus of this class.  Sometimes we watched documentaries and listened to music in Mandarin to get a sense of the language as used in different contexts. It was definitely good practice in learning to understand a wide variety of voices.\n\n#### ![Ginger Chicken Soup](/uploads/img_20191019_130453_exported_stabilized_178720828601232833.gif \"Ginger Chicken Soup\")*Ginger Chicken Soup*\n\n## Philosophy\n\n*One of these things is not like the others!*\n\nI had extra time to take an English language class, so I decided on Chinese Philosophy! For a diehard STEM aficionado, I do really like dabbling in philosophy when I can. Most classes I can take back at home barely even touch on the existence of the Eastern half of the tradition though, so I was very excited to have the opportunity. The class covered the core texts, tenets, and philosophers of China's major philosophical schools: Confucianism, Daoism, Mohism, Legalism, and Chinese Buddhism. This class also really helped me to contextualize a lot of the more historical areas I visited during the trip.\n\n# Housing\n\nHousing was initially tough to sort out. I registered for my dorm over the summer, but what I didn't know at the time was that the full housing payment would be due up front. In cash. That threw a wrench in my plans for a couple of days. If you're feeling daring, you should try traveling halfway around the world and pulling a huge wad cash out of an ATM just to see what happens. It doesn't help that China's largest bill is worth about $14 at the time of writing.\n\n#### ![Dorm View](/uploads/mvimg_20190829_044435.jpg)*View from my dorm*\n\nIt took a few days to get the money, but I was able to placate the receptionist with a deposit in the meantime. Here are some pics of the room. I'd tell you the mess was from unpacking, but it never looked much nicer than this so that would just be a lie.\n\n#### ![My dorm](/uploads/mvimg_20190901_141543.jpg \"My dorm\")\n\nIn the end I was placed in a dorm on the 11th story of one of the exchange student dorms on campus with a roommate from Japan. Plenty of amenities including a private bathroom and laundry facilities.\n\nI had a great time in China and I'm happy to be getting around to posting these updates! More to come on the less academic aspects of the trip, enjoy!","data":{"layout":"blog","title":"Study Abroad","url":"study-abroad","published":false,"date":"2020-04-08T13:52:23.205Z","update":"","thumbnail":"/uploads/img_20191206_155614.jpg","tags":["Travel","China Study 2019"],"slug":"study-abroad"},"isEmpty":false,"excerpt":""}},"path":"blog/study-abroad"}
