{"template":"../src/containers/BlogPost","sharedHashesByProp":{},"data":{"post":{"content":"This past Thursday marks four whole weeks since I arrived in Shanghai for my study abroad. That's a long time without an update. I have a thousand excuses, so I figured I might as well write them all in one place.\n\nFor those of you who don't follow what I'm up to at all times, surprise! I'm in China. I'll be here through December in an effort to make my Chinese less horrible. During that time I will be staying at East China Normal University's Zhongbei campus (华东师范大学).\n\nHere's the important stuff I'm doing here. If I do anything big, I'll try to make it into its own post.\n\n# Classes\n\nIt's probably not that surprising that most of my class time will be dedicated to language learning. Five days per week (Monday through Friday) I have classes taught in Mandarin from 8:30am until 11:45am. There's a 15 minute break in there too which I like to use to grab coffee from the shop across the street.\n\n## Speaking\n\nOn Monday and Wednesday I have speaking class. This mainly focuses on new grammar and proper use of the words/grammar I already know. There is also new vocabulary introduced each period. So far, classes have focused rather intensely on naming synonyms/antonyms of known vocabulary, as well as articulating the differences between closely related words and phrases. I've really appreciate these lessons so far. They're great for cultivating a better command of the language.\n\n## Reading/Writing\n\nOn Tuesday and Thursday I instead have reading/writing class. Much of this class consists of taking turns from a presentation prepared by the professor. We also have to take weekly dictation tests during which the professor reads the new vocabulary and we have to write what is said. As you might imagine, this isn't as straightforward in Chinese as it is in other languages.\n\n## Listening\n\nFriday mornings are for listening class. I've only had one period of this so far, but it seems that the main focus is on listening to audio tracks and taking short workbook quizzes about them. It's definitely good practice in learning to understand a wide variety of voices.\n\n## Philosophy\n\n_One of these things is not like the others!_\n\nI had extra time to take an English language class, so I decided on Chinese Philosophy! For a diehard STEM afficionado, I do really like dabbling in philosophy when I can. Most classes I can take back at home barely even touch on the existence of the Eastern half of the tradition though, so I'm looking forward to this being a productive learning opportunity. The class will cover the core texts, tenets, and philosophers of China's major philosophical schools. These will include Confucianism, Daoism, Mohism, Legalism, and Chinese Buddhism.\n\n# Housing\n\nHousing was initially tough to sort out. A few months ago, I registered for the dorm I'm living in now. What I didn't know at the time was that the 10,000 RMB (~$1400) would be due up front. In cash. That threw a wrench in my plans for a couple of days. If you're feeling daring, you should try traveling halfway around the world and pulling that much cash out of an ATM just to see what happens.\n\n![Money](/uploads/img_20190901_084406.jpg)\n_China needs some higher denomination money. 100 RMB is about $14_\n\nIt took a few days to get the money, but I was able to placate the receptionist with a deposit in the meantime. Here are some pics of the room. I'd tell you the mess was from unpacking, but it's been four weeks and it has only gotten worse, so that would just be a lie.\n\n![My dorm](/uploads/mvimg_20190901_141543.jpg)\n\n![The bathroom](/uploads/mvimg_20190901_141643.jpg)\n_It's an all in one, but I'm grateful to have one in our room_\n\n\n\nFurther updates to come whenever I feel like posting them.\n","data":{"layout":"blog","title":"Study Abroad","url":"study-abroad","published":false,"date":"2019-09-21T13:52:23.205Z","update":"","tags":["Travel","China Study 2019"],"slug":"study-abroad"},"isEmpty":false,"excerpt":""}},"path":"blog/study-abroad"}
